{
    "name": "Saloni Katiyar",
    "tagline": "Data Scientist Intern | MS Data Analytics | UCF May 2021",
    "emailid": "salonikatiyar1997@gmail.com",
    "phone": "+1 407-529-8855",
    "links": {
        "linkedin": "https://www.linkedin.com/in/saloni-katiyar-154b6b156/",
        "gitrepo": "https://github.com/salonikatiyar"
    },
    "about": "/stest/ss",
    "timeline": [
        {
            "title": "Data Scientist – Intern",
            "org": "Advancing Technologies",
            "duration": "October 2020 – May 2021",
            "place": "Orlando, Florida",
            "description": "Developing a solution for providing performance analytics for combat sports athletes and an app which collects the data through the device and to build a machine learning model which provides useful insights to the application. Engineering the database on the server side using Mongo DB and deploying it on AWS. Also, to establish connectivity between the database and the machine learning models. Exploring data and prospects of suitable algorithm for building the time-series and classification models. Using python language for machine learning and visualization purposes. By the end of this project we will have an application made using Xamarin forms for the wearable device which will be coming out in the market soon"
        },
        {
            "title": "Graduate Teaching Assitant",
            "org": "University of Central Florida",
            "duration": "August 2019 - May 2021",
            "place": "Orlando, Florida",
            "description": "Solving queries and aiding undergraduate students understand the computer science course material. Structuring lab material and mentoring lab sessions. Grading and evaluating submissions of students’ programming assignments and tests"
        },
        {
            "title": "Data Analyst Consultant",
            "org": "University of Central Florida",
            "duration": "August 2020 - December 2020",
            "place": "Orlando, Florida",
            "description": "The goal of this project was to help UCF CECS improve their college ranking by analyzing the USNWR ranking data for past 10 years, identify any trends, build a rank predictor algorithm and give recommendations to UCF CECS on the most important steps needed to improve their college rankings. Spearheaded the team to build an analytical dashboard using tableau to present insights or trends along with an interactive tool integrated using TabPy that can predict the ranking for a college where changing a parameter can reflect the change in ranking it will cause. Implemented two models: Ordinal Regression for prediction and LSTM RNN model for time series analysis.The code was written in python"
        },
        {
            "title": "Master's Degree, Data Analytics",
            "org": "University of Central Florida",
            "duration": "August 2019 - May 2021",
            "place": "Orlando, Florida",
            "description": ""
        },
        {
            "title": "Intern",
            "org": "Quantta Analytics",
            "duration": "February 2018 - April 2018",
            "place": "Kolkata, India",
            "description": "Analyzed large amounts of data to find patterns of fraud. Learned basic concepts of ETL process and business intelligence. Automated the process of data scraping using R and worked closely with clients to establish problem specifications and system design"
        },
        {
            "title": "Project Assistant Intern",
            "org": "Tata Consultancy Services",
            "duration": "May 2017 - July 2017",
            "place": "Kolkata, India",
            "description": "Worked on Visual studio IDE. Involved in complete life cycle including analysis, design and development. Applied OOP’s concept, ADO DOTNET, namespaces in designing and development of an application"
        },
        {
            "title": "Bachelor's Degree, Computer Science",
            "org": "Amity University",
            "duration": "August 2014 - May 2018",
            "place": "Lucknow, India",
            "description": ""
        }
    ],
    "projects": [
        {
            "title": "Abstractive Text Summarizer",
            "description": "Proposed a method that utilizes abstractive techniques for text classification. Built a model that takes sentences into an encoder-decoder architecture and scores them based on their words and the frequencies of those words. For the model used a two-layered bidirectional RNN with LSTMs on the input data and two layers, each with an LSTM using bahdanau attention on the target data.",
            "link": "https://github.com/salonikatiyar/Abstractive-Text-Summarizer"
        },
        {
            "title": "Recommendation System",
            "description": "Formulated a personalized recommendation system for ecommerce websites by tailoring the contents based on needs of each user. Presented exploratory data analysis using tableau and built a model using LightFM to compute matrix factorization and optimized the cost function. Performed hyper parameter tuning and captured the best estimator that performed better using AUC as evaluation metric. From the precision scores it was inferred that top 3 recommended items were 44.28% relevant to user.",
            "link": "https://github.com/salonikatiyar/Recommendation-System"
        },
        {
            "title": "Advanced Regression Techniques",
            "description": "Predicted the final price of each house in Iowa based on 79 different features. Built a model and deducted that lasso regressions performs the best with a cross validation RMSE-score of 0.1121. The XGBoost model also performed well with a cross validation RMSE of 0.1162, as the Lasso cross validated RMSE is better than XGBoost’s CV score, it was decided to weight the Lasso results to double.",
            "link": "https://github.com/salonikatiyar"
        },
        {
            "title": "Determine Factors Influencing Placements Using Machine Learning",
            "description": "In this project, dataset of campus placement was used to analyze factors which contributes towards the success of student getting placed. Did exploratory data analysis and built classification models such as decision tree, support vector machine, naïve bayes and random forest models. While using classification algorithms, Random Forest performed the best with accuracy of 95.24%. Executed dimension reduction techniques using Principal Component Analysis and t-SNE. Implemented clustering algorithms such as K-Means, Clara, Pam, Hierarchical clustering with Kohonen, and Self-Organizing Map. K-Means with k=2 performed exceptionally well.",
            "link": "https://github.com/salonikatiyar/Academic-and-Employability-Factors-Influencing-Placements"
        },
        {
            "title": "Visulaization of Gun Violence in the US",
            "description": "Main goal was to draw insights on the basis of timeline, location and the count of number of victims. Performed in-depth analysis and developed a dashboard using RShiny to demonstrate the results.",
            "link": "https://github.com/salonikatiyar/Gun-Violence-in-US"
        }
    ]
}